app/views/employees/show.html.erb

SELECT `documents`.* FROM `documents` WHERE `documents`.`employee_id` = 2
---
		 </div>
		 <% if @employee.documents.present? %>