app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents`
---
  def index
    @documents = Document.all

INSERT INTO `documents` (`name`, `doc_type`, `employee_id`, `created_at`, `updated_at`) VALUES ('10th marksheet', 'marksheet', 2, '2023-07-24 04:56:51.801346', '2023-07-24 04:56:51.801346')
---
  def create
    @document = Document.new(document_params)
    if @document.save

UPDATE `documents` SET `documents`.`doc_type` = 'Marksheet', `documents`.`updated_at` = '2023-07-24 05:39:33.591886' WHERE `documents`.`id` = 5
---
  def update
    if @document.update(document_params)

DELETE FROM `documents` WHERE `documents`.`id` = 3
---
  def destroy
    if @document.destroy

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1
---
  def set_document
    @document = Document.find(params[:id])