app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT `employees`.* FROM `employees`

  def create
    @employee = Employee.new(employee_params)
    if @employee.save
---
INSERT INTO `employees` (`first_name`, `middle_name`, `last_name`, `personal_email`, `city`, `state`, `country`, `pincode`, `address_line_1`, `address_line_2`, `created_at`, `updated_at`) VALUES ('aksha ', 'rahul', 'pounikar', 'aksha@123.com', 'ng', 'mh', 'in', '440055', 'Adress line 1', '', '2023-07-21 11:51:34.441739', '2023-07-21 11:51:34.441739')

  def update
    if @employee.update(employee_params)
---
UPDATE `employees` SET `employees`.`address_line_1` = 'Adress line 6', `employees`.`updated_at` = '2023-07-21 11:53:53.014710' WHERE `employees`.`id` = 7

  def destroy
    if @employee.destroy
---
DELETE FROM `employees` WHERE `employees`.`id` = 9

  def set_employee
    @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 9 LIMIT 1