app/controllers/home_controller.rb

  def index
    @title_text = 'Hello world'
    @subtitle_text = 'I am learning Rails'
    @employees = Employee.all
---
SELECT `employees`.* FROM `employees`